# `01.ipynb`

---

Ai's solutions for this [notebook](https://github.com/zachhall/pandas_exercises/tree/master/01_Getting_%26_Knowing_Your_Data/Occupation)

## ‚ùÑ Step 1. Import the necessary libraries

In [1]:
import os
import pandas as pd

## üå∏ Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user).

## ‚ùÑ Step 3. Assign it to a variable called users and use the `user_id` as index

In [2]:
path = os.path.join(".", "..", "..", "data", "01", "u.user")
df = pd.read_csv(path, sep="|")

## üå∏ Step 4. See the first 25 entries

In [3]:
df.head(25)

    user_id  age gender     occupation zip_code
0         1   24      M     technician    85711
1         2   53      F          other    94043
2         3   23      M         writer    32067
3         4   24      M     technician    43537
4         5   33      F          other    15213
5         6   42      M      executive    98101
6         7   57      M  administrator    91344
7         8   36      M  administrator    05201
8         9   29      M        student    01002
9        10   53      M         lawyer    90703
10       11   39      F          other    30329
11       12   28      F          other    06405
12       13   47      M       educator    29206
13       14   45      M      scientist    55106
14       15   49      F       educator    97301
15       16   21      M  entertainment    10309
16       17   30      M     programmer    06355
17       18   35      F          other    37212
18       19   40      M      librarian    02138
19       20   42      F      homemaker    95660
20       21   26      M         writer    30068
21       22   25      M         writer    40206
22       23   30      F         artist    48197
23       24   21      F         artist    94533
24       25   39      M       engineer    55107

## ‚ùÑ Step 5. See the last 10 entries

In [4]:
df.tail(10)

     user_id  age gender     occupation zip_code
933      934   61      M       engineer    22902
934      935   42      M         doctor    66221
935      936   24      M          other    32789
936      937   48      M       educator    98072
937      938   38      F     technician    55038
938      939   26      F        student    33319
939      940   32      M  administrator    02215
940      941   20      M        student    97229
941      942   48      F      librarian    78209
942      943   22      M        student    77841

## üå∏ Step 6. What is the number of observations in the dataset?

In [5]:
df.shape[0]

943

## ‚ùÑ Step 7. What is the number of columns in the dataset?

In [6]:
df.shape[1]

5

## üå∏ Step 8. Print the name of all the columns.

In [7]:
df.columns

Index(['user_id', 'age', 'gender', 'occupation', 'zip_code'], dtype='object')

## ‚ùÑ Step 9. How is the dataset indexed?

In [8]:
df.index

RangeIndex(start=0, stop=943, step=1)

## üå∏ Step 10. What is the data type of each column?

In [9]:
df.dtypes

user_id        int64
age            int64
gender        object
occupation    object
zip_code      object
dtype: object

## ‚ùÑ Step 11. Print only the occupation column

In [10]:
df["occupation"]

0         technician
1              other
2             writer
3         technician
4              other
           ...
938          student
939    administrator
940          student
941        librarian
942          student
Name: occupation, Length: 943, dtype: object

## üå∏ Step 12. How many different occupations are in this dataset?

In [11]:
df["occupation"].unique().shape[0]

21

## ‚ùÑ Step 13. What is the most frequent occupation?

In [12]:
df["occupation"].value_counts().index[0]

'student'

## üå∏ Step 14. Summarize the DataFrame.

In [13]:
df.describe()

          user_id         age
count  943.000000  943.000000
mean   472.000000   34.051962
std    272.364951   12.192740
min      1.000000    7.000000
25%    236.500000   25.000000
50%    472.000000   31.000000
75%    707.500000   43.000000
max    943.000000   73.000000

## ‚ùÑ Step 15. Summarize all the columns

In [14]:
df.describe(include="all")

           user_id         age gender occupation zip_code
count   943.000000  943.000000    943        943      943
unique         NaN         NaN      2         21      795
top            NaN         NaN      M    student    55414
freq           NaN         NaN    670        196        9
mean    472.000000   34.051962    NaN        NaN      NaN
std     272.364951   12.192740    NaN        NaN      NaN
min       1.000000    7.000000    NaN        NaN      NaN
25%     236.500000   25.000000    NaN        NaN      NaN
50%     472.000000   31.000000    NaN        NaN      NaN
75%     707.500000   43.000000    NaN        NaN      NaN
max     943.000000   73.000000    NaN        NaN      NaN

## üå∏ Step 16. Summarize only the occupation column

In [20]:
df["occupation"].describe()

count         943
unique         21
top       student
freq          196
Name: occupation, dtype: object

## ‚ùÑ Step 17. What is the mean age of users?

In [21]:
df["age"].mean()

34.05196182396607

## üå∏ Step 18. What is the age with least occurrence?

In [41]:
ser = df["age"].value_counts()
first_index = ser.argmin()

ser.index[first_index:].tolist()

[7, 66, 11, 10, 73]

## üìö References üìö

- [‚ùÑ Platform-independent file paths? | Stack Overflow](https://stackoverflow.com/a/6036156)
    - [üìù Python 3 docs](https://docs.python.org/3/library/os.path.html#os.path.join)